schreibfaul1/ESP32-MiniWebRadio/src/common.h
    int calculateDisplayStartPosition(int list_size, int current_position) {
        // Calculate the theoretical starting position to get current_position to the middle
        int start_position = current_position - 4;
        // Make sure the starting position is not negative
        start_position = std::max(0, start_position);
        // Make sure the starting position doesn't go beyond the end of the list
        if (start_position + 9 > list_size) {
            start_position = std::max(0, list_size - 9);
        }
        return start_position;
    }


    void hasReleased(uint16_t x, uint16_t y){
        m_fileListPos = y / (m_h / 10);

        if(m_oldY && (m_oldY - 2 * m_lineHight > y)) { // -------------------------------------- normal wipe up
            m_browseOnRelease = 1;
            goto exit;
        }

        if(m_oldY && (m_oldY + 2 * m_lineHight < y)) { // -------------------------------------- normal wipe down
            m_browseOnRelease = 2;
            goto exit;
        }

        if(m_fileListPos == 0) { //  ----------------------------------------------------------- previous folder
            if(lastIndexOf(m_curAudioFolder, '/') > 1){  // not the first '/'
                m_browseOnRelease = 3;
            }
        }
        else {
            if(m_fileListPos + m_viewPos> _SD_content.getSize()) goto exit; // ----------------- next folder
            int idx = m_viewPos + m_fileListPos -1;
            if(_SD_content.isDir(idx)){
                strcpy(m_curAudioName, "");
                strcpy(m_curAudioFolder, _SD_content.getFilePathByIndex(idx));
                m_browseOnRelease = 4;
            }
            else { // -------------------------------------------------------------------------- playfile
                strcpy( m_curAudioName, _SD_content.getFileNameByIndex(idx) );
                strcpy(m_curAudioFolder, _SD_content.getFileFolderByIndex(idx));
                strcpy(m_curAudioPath, _SD_content.getFilePathByIndex(idx));
                m_browseOnRelease = 5;
            }
        }
exit:
        return;
    }
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
extern stationManagement   staMgnt;
class stationsList{
private:
    int16_t     m_x = 0;
    int16_t     m_y = 0;
    int16_t     m_w = 0;
    int16_t     m_h = 0;
    int16_t     m_oldX = 0;
    int16_t     m_oldY = 0;
    uint8_t     m_lineHight = 0;
    uint16_t    m_firstStationsLineNr = 0;
    uint16_t*   m_curSstationNr = NULL;
    uint8_t     m_browseOnRelease = 0;
    uint8_t     m_fontSize = 0;
    uint8_t     m_stationListPos = 0;
    uint32_t    m_bgColor = 0;
    bool        m_enabled = false;
    bool        m_clicked = false;
    bool        m_state = false;
    char*       m_name = NULL;
    char*       m_pathBuff = NULL;
    char*       m_buff = NULL;
    releasedArg m_ra;
public:
    stationsList(const char* name){
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("stationsList");
        m_bgColor = TFT_BLACK;
        m_enabled = false;
        m_clicked = false;
        m_state = false;
        m_pathBuff = x_ps_malloc(50);
        m_ra.arg1 = NULL;
        m_ra.arg2 = NULL;
        m_ra.val1 = 0;
        m_ra.val2 = 0;
    }
    ~stationsList(){
        if(m_name){free(m_name); m_name = NULL;}
        if(m_buff){free(m_buff); m_buff = NULL;}
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint8_t fontSize, uint16_t* curStationNr){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        m_lineHight = m_h / 10;
        m_fontSize = fontSize;
        m_curSstationNr = curStationNr;
        m_enabled = false;
    }
    void show(){
        m_clicked = false;
        m_enabled = true;
        m_browseOnRelease = 0;
        stationslist(true);
    }
    void hide(){
        m_enabled = false;
        tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
    }
    void disable(){
        m_enabled = false;
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled) m_clicked = true;
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
        if(!m_enabled) return false;
        hasClicked(x - m_x, y - m_y);
        return true;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;

        if(m_browseOnRelease == 1)  {   stationslist(false);                                             // wipe up
                                    }
        if(m_browseOnRelease == 2)  {   stationslist(false);                                             // wipe down
                                    }
        if(m_browseOnRelease == 3)  {   tft.writeText(m_buff, 10, m_y + (m_stationListPos)*m_lineHight, m_w - 10, m_lineHight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, true);
                                        vTaskDelay(300 / portTICK_PERIOD_MS);
                                        m_ra.val1 = m_firstStationsLineNr + m_stationListPos + 1;   // station number
                                    }
        m_browseOnRelease = 0;
        m_oldX = 0; m_oldY = 0;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        if(m_buff){free(m_buff); m_buff = NULL;}
        m_ra.val1 = 0;
        m_ra.arg1 = NULL;
        return true;
    }
private:
    void stationslist(bool first){
        xSemaphoreTake(mutex_display, portMAX_DELAY);
        if(first){
            if(staMgnt.getSumStations() <= 10) m_firstStationsLineNr = 0;
            else  if(*m_curSstationNr < 5) m_firstStationsLineNr = 0;
            else if(*m_curSstationNr +5 <= staMgnt.getSumStations()) m_firstStationsLineNr = *m_curSstationNr - 5;
            else m_firstStationsLineNr = staMgnt.getSumStations() - 10;
        }
        else{
            tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
        }
        char* stationStr = x_ps_malloc(1024);
        tft.setFont(m_fontSize);
        for(uint8_t pos = 0; pos < 10; pos++) {

            if(pos + m_firstStationsLineNr + 1 > staMgnt.getSumStations()) break;

            if((pos + m_firstStationsLineNr + 1) == *m_curSstationNr){
                sprintf(stationStr, ANSI_ESC_YELLOW "%03d " ANSI_ESC_MAGENTA, ( pos + m_firstStationsLineNr + 1)); // is currStationNr
            }
            else{
                if(staMgnt.getStationFav(pos + m_firstStationsLineNr + 1) == '*'){
                    sprintf(stationStr, ANSI_ESC_YELLOW "%03d " ANSI_ESC_WHITE, (pos + m_firstStationsLineNr + 1));
                }
                else{
                    sprintf(stationStr, ANSI_ESC_YELLOW "%03d " ANSI_ESC_GREY, (pos + m_firstStationsLineNr + 1));
                }
            }
            strcpy(stationStr + strlen(stationStr), staMgnt.getStationName(pos + m_firstStationsLineNr + 1));

            for(int i = 0; i < strlen(stationStr); i++) {if(stationStr[i] == '#') stationStr[i] = '\0';}
            tft.writeText(stationStr, 10, m_y + (pos)*m_lineHight, m_w - 10, m_lineHight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, true);
        }
        xSemaphoreGive(mutex_display);
    }
    void hasClicked(uint16_t x, uint16_t y){
        m_stationListPos = y / (m_h / 10);
        if(m_oldY && (m_oldY + 2 * m_lineHight < y)) { // wipe up
            if(m_browseOnRelease != 1){
                m_browseOnRelease = 1;
                if(m_firstStationsLineNr == 0) {m_browseOnRelease = 0; return;} // nothing to do
                else if(m_firstStationsLineNr < 10) m_firstStationsLineNr = 0;
                else m_firstStationsLineNr -= 9;
            }
            return;
        }

