schreibfaul1/ESP32-MiniWebRadio/src/common.h
    void updateBitRate(uint32_t bitRate){
        m_bitRate = bitRate;
        if(!m_enabled) return;
        char sbr[10];
        itoa(bitRate, sbr, 10);
        if(m_bitRate < 1000) { strcat(sbr, "K"); }
        else {
            sbr[2] = sbr[1];
            sbr[1] = '.';
            sbr[3] = 'M';
            sbr[4] = '\0';
        }
        xSemaphoreTake(mutex_display, portMAX_DELAY);
        tft.setFont(m_fontSize);
        tft.setTextColor(m_bitRateColor);
        tft.fillRect(m_bitRate_x, m_y, m_bitRate_w, m_h, m_bgColor);
        uint8_t space = 2;
        if(strlen(sbr) < 4) space += 5;
        tft.writeText(sbr, m_bitRate_x + space, m_y, m_bitRate_w, m_h, TFT_ALIGN_CENTER, TFT_ALIGN_CENTER);
        xSemaphoreGive(mutex_display);
    }
    void setBitRateColor(uint16_t bitRateColor){
        m_bitRateColor = bitRateColor;
    }
    void setIpAddr(const char* ipAddr){
        if(m_ipAddr){free(m_ipAddr); m_ipAddr = NULL;}

        #pragma GCC diagnostic push
        #pragma GCC diagnostic ignored "-Wuse-after-free"
        m_ipAddr = strdup(ipAddr);
        char myIP[30] = "IP:";
        strcpy(myIP + 3, ipAddr);
        #pragma GCC diagnostic pop

        tft.setFont(m_fontSize);
        tft.setTextColor(m_ipAddrColor);
        xSemaphoreTake(mutex_display, portMAX_DELAY);
        tft.fillRect(m_ipAddr_x, m_y, m_ipAddr_w, m_h, m_bgColor);
        tft.writeText(myIP, m_ipAddr_x, m_y, m_ipAddr_w, m_h, TFT_ALIGN_RIGHT, TFT_ALIGN_CENTER, true);
        xSemaphoreGive(mutex_display);
    }
    void setIpAddrColor(uint16_t ipAddrColor){
        m_ipAddrColor = ipAddrColor;
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled) m_clicked = true;
        uint8_t pos = 0;
        if(x >= m_rssiSymbol_x && x <= m_rssiSymbol_x + m_rssiSymbol_w) pos = 3; // RSSI or TC
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, pos);
        if(!m_enabled) return false;
        return true;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;
        m_clicked = false;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        return true;
    }
private:
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

inline void GetRunTimeStats( char *pcWriteBuffer ){
    // TaskStatus_t *pxTaskStatusArray;
    // volatile UBaseType_t uxArraySize, x;
    // uint32_t ulTotalRunTime, ulStatsAsPercentage;
    // char leftSpace[] = "             ";

    // // Make sure the write buffer does not contain a string.
    // *pcWriteBuffer = 0x00;

    // // Take a snapshot of the number of tasks in case it changes while this function is executing.
    // uxArraySize = uxTaskGetNumberOfTasks();

    // // Allocate a TaskStatus_t structure for each task.  An array could be allocated statically at compile time.
    // pxTaskStatusArray = (TaskStatus_t*)pvPortMalloc( uxArraySize * sizeof( TaskStatus_t ) );

    // if( pxTaskStatusArray != NULL ) {
    // // Generate raw status information about each task.
    //     uxArraySize = uxTaskGetSystemState( pxTaskStatusArray, (UBaseType_t)uxArraySize, &ulTotalRunTime );

    //     // For percentage calculations.
    //     ulTotalRunTime /= 100UL;

    //     char* tmpBuff = (char*) malloc(100);
    //     strcpy(pcWriteBuffer, leftSpace);
    //     strcat(pcWriteBuffer, ANSI_ESC_YELLOW "TASKNAME            | RUNTIMECOUNTER | TOTALRUNTIME[%] | CORE | PRIO  |\n");
    //     strcat(pcWriteBuffer, leftSpace);
    //     strcat(pcWriteBuffer,                 "--------------------+----------------+-----------------+------+-------|\n");

    //     // Avoid divide by zero errors.
    //     if(ulTotalRunTime > 0){
    //         // For each populated position in the pxTaskStatusArray array, format the raw data as human readable ASCII data
    //         for( x = 0; x < uxArraySize; x++ ) {
    //             // What percentage of the total run time has the task used? This will always be rounded down to the nearest integer.
    //             // ulTotalRunTimeDiv100 has already been divided by 100.
    //             ulStatsAsPercentage = pxTaskStatusArray[ x ].ulRunTimeCounter / ulTotalRunTime;
    //             memset(tmpBuff, 0x20, 100);
    //             memcpy(tmpBuff, pxTaskStatusArray[x].pcTaskName, strlen(pxTaskStatusArray[x].pcTaskName));
    //             tmpBuff[20] = '|';
    //             uint8_t core = (pxTaskStatusArray[x].xCoreID);
    //             uint8_t prio = (pxTaskStatusArray[x].uxBasePriority);
    //             if(ulStatsAsPercentage){
    //                 sprintf(tmpBuff + 23, "%12lu  |       %02lu%%       |%4d  |%5d  |", (long unsigned int)pxTaskStatusArray[ x ].ulRunTimeCounter, (long unsigned int)ulStatsAsPercentage, core, prio);
    //             }
    //             else{
    //                 sprintf(tmpBuff + 23, "%12lu  |       <1%%       |%4d  |%5d  |", (long unsigned int)pxTaskStatusArray[ x ].ulRunTimeCounter, core, prio);
    //             }
    //             uint8_t i = 23; while(tmpBuff[i] == '0') {tmpBuff[i] = ' '; i++;}
    //             if(tmpBuff[45] == '0') tmpBuff[45] = ' ';
    //             strcat(pcWriteBuffer, leftSpace);
    //             strcat(pcWriteBuffer, tmpBuff);
    //             strcat(pcWriteBuffer, "\n");
    //         }
    //         free(tmpBuff);
    //        }
    //     // The array is no longer needed, free the memory it consumes.
    //     vPortFree( pxTaskStatusArray );
    // }
}

const char stations_json[] =
    "[[\"*\",\"D\",\"0N 70s\",\"http://0n-70s.radionetz.de:8000/0n-70s.mp3\"],"
    "[\"*\",\"D\",\"0N 80s\",\"http://0n-80s.radionetz.de:8000/0n-80s.mp3\"],"
    "[\"*\",\"D\",\"0N 90s\",\"http://0n-90s.radionetz.de:8000/0n-90s.mp3\"],"
    "[\"*\",\"D\",\"0N Charts\",\"http://0n-charts.radionetz.de:8000/0n-charts.mp3\"],"
    "[\"*\",\"D\",\"0N Dance\",\"http://0n-dance.radionetz.de:8000/0n-dance.mp3\"],"
    "[\"*\",\"D\",\"0N Disco\",\"http://0n-disco.radionetz.de:8000/0n-disco.mp3\"],"
    "[\"*\",\"D\",\"1000 Oldies\",\"http://c3.auracast.net:8010/stream\"],"
    "[\"*\",\"D\",\"Eurodance\",\"http://www.laut.fm/eurodance\"],"
    "[\"\",\"D\",\"extra-radio 88.0\",\"https://www.extra-radio.de/stream/listen.m3u\"],"
    "[\"*\",\"D\",\"Hitradio SKW\",\"http://server4.streamserver24.com:2199/tunein/hitradio.asx\"],"
    "[\"*\",\"D\",\"MacSlon's Irish Pub Radio\",\"http://macslons-irish-pub-radio.stream.laut.fm/macslons-irish-pub-radio\"],"
    "[\"\",\"GR\",\"Άνοιξη 100.7\",\"http://solid1.streamupsolutions.com:55023/stream\"],"
    "[\"\",\"RU\",\"НАШЕ Радио\",\"http://nashe1.hostingradio.ru/nashe-128.mp3\"],"
    "[\"\",\"RU\",\"Радио Русские Песни\",\"http://listen.rusongs.ru/ru-mp3-128\"],"
    "[\"\",\"BG\",\"Свежа България\",\"http://31.13.223.148:8000/fresh.mp3\"],"
    "[\"\",\"CH\",\"SWISS POP\",\"https://stream.srg-ssr.ch/rsp/aacp_48.asx\"],"
    "[\"\",\"BG\",\"BGRADIO\",\"http://play.global.audio/bgradio_low.ogg\"],"
    "[\"\",\"D\",\"knixx.fm\",\"http://s1.knixx.fm:5347/dein_webradio_vbr.opus\"],"
    "[\"*\",\"D\",\"- 0 N - Christmas on Radio\",\"https://0n-christmas.radionetz.de/0n-christmas.aac\"],"
    "[\"*\",\"UK\",\"BBC 6music\",\"http://as-hls-ww-live.akamaized.net/pool_904/live/ww/bbc_6music/bbc_6music.isml/bbc_6music-audio=96000.norewind.m3u8\"],"
    "[\"\",\"D\",\"- 0 N - Movies on Radio\",\"https://0n-movies.radionetz.de/0n-movies.mp3\"],"
    "[\"*\",\"D\",\"- 0 N - Top 40 on Radio\",\"https://0n-top40.radionetz.de/0n-top40.mp3\"],"
    "[\"\",\"D\",\"ROCKANTENNE Alternative (mp3)\",\"https://stream.rockantenne.de/alternative/stream/mp3\"],"
    "[\"\",\"P\",\"Gra Wrocław\",\"http://rmfstream2.interia.pl:8000/radio_gra_wroc\"],"
    "[\"*\",\"RU\",\"Classic EuroDisco Радио\",\"https://live.radiospinner.com/clsscrdsc-96\"],"
    "[\"*\",\"D\",\"Hit Radio FFH - Soundtrack (AAC+)\",\"http://streams.ffh.de/ffhchannels/aac/soundtrack.m3u\"]]";

const char aesKey [] = "mysecretkey12345";

inline const char* aes_encrypt(const char* input) {
    static char* output = NULL;
    uint16_t len = strlen(input) / 16;
    len++;
    if(output){free (output); output = NULL;}
    output = (char*) x_ps_calloc((len * 16) + 1, 1);
    mbedtls_aes_context aes;
    mbedtls_aes_init(&aes);
    mbedtls_aes_setkey_enc(&aes, (const unsigned char*) aesKey, 128);
    mbedtls_aes_crypt_ecb(&aes, MBEDTLS_AES_ENCRYPT, (const unsigned char*) input, (unsigned char*) output);
    mbedtls_aes_free(&aes);
    return output;
}

inline const char* aes_decrypt(const char* input) {
    static char* output = NULL;
    uint16_t len = strlen(input) + 1;
    if(output){free (output); output = NULL;}
    output = (char*) x_ps_calloc(len, 1);
    mbedtls_aes_context aes;
    mbedtls_aes_init(&aes);
    mbedtls_aes_setkey_dec(&aes, (const unsigned char*) aesKey, 128);
    mbedtls_aes_crypt_ecb(&aes, MBEDTLS_AES_DECRYPT, (const unsigned char*) input, (unsigned char*) output);
    mbedtls_aes_free(&aes);
    return output;
}

inline void encode_base64(const unsigned char* input, size_t input_len) {
    // Buffer-Größe berechnen für Base64-Kodierung
    size_t buffer_size = ((input_len + 2) / 3) * 4 + 1;
    unsigned char* output = (unsigned char*)malloc(buffer_size);  // Dynamischer Buffer

    size_t output_len;
    int ret = mbedtls_base64_encode(output, buffer_size, &output_len, input, input_len);

    if (ret == 0) {
        printf("Base64-Kodierung: %s\n", output);
    } else {
        printf("Fehler bei der Base64-Kodierung\n");
    }

    free(output);  // Buffer freigeben
}

inline void decode_base64(const char* input, size_t input_len) {
    size_t output_len;
    // Buffer-Größe berechnen für Base64-Dekodierung
    size_t buffer_size = (input_len  / 4) * 3 + 1;
    unsigned char* output = (unsigned char*)malloc(buffer_size);  // Dynamischer Buffer

    // Dekodierung
    int ret = mbedtls_base64_decode(output, sizeof(output), &output_len, (const unsigned char*)input, input_len);

    if (ret == 0) {
        printf("Dekodierter Text: %s\n", output);
    } else {
        printf("Fehler bei der Base64-Dekodierung\n");
    }
    free(output);  // Buffer freigeben
}
